In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('./historical.csv')
df.head()

          item month  sales  inventory  orders  order size  turnover
0  Lawn Chairs   Jan      5         50       0          20    0.1000
1  Lawn Chairs   Feb      8         45       0          20    0.1778
2  Lawn Chairs   Mar     12         37       0          20    0.3243
3  Lawn Chairs   Apr     12         25       1          20    0.4800
4  Lawn Chairs   May     23         33       1          20    0.6970

In [4]:
sales_data = df["sales"].groupby(df['item'])
inventory_data = df["inventory"].groupby(df['item'])
order_data = df["orders"].groupby(df['item'])

In [5]:
df["sales"].groupby(df['item']).max()

item
Coolers             78
Crossbows          142
Flippy Floppies     90
Lawn Chairs         50
Pool Noodles        98
Umbrellas           70
Waffle Irons       112
Name: sales, dtype: int64

In [6]:
df.loc[df.groupby("item")["sales"].idxmax()]

               item month  sales  inventory  orders  order size  turnover
30          Coolers   Jul     78         68       6          10    1.1471
47        Crossbows   Dec    142         26       0           5    5.4615
74  Flippy Floppies   Mar     90         46       1         100    1.9565
6       Lawn Chairs   Jul     50         25       2          20    2.0000
62     Pool Noodles   Mar     98         69       1          50    1.4203
15        Umbrellas   Apr     70         85       1          25    0.8235
49     Waffle Irons   Feb    112        157       0          20    0.7134

In [7]:
df["sales"].groupby(df['item']).mean().round()

item
Coolers            39.0
Crossbows          52.0
Flippy Floppies    73.0
Lawn Chairs        22.0
Pool Noodles       65.0
Umbrellas          48.0
Waffle Irons       56.0
Name: sales, dtype: float64

In [9]:
df["inventory"].groupby(df['item']).mean().round()

item
Coolers             66.0
Crossbows           19.0
Flippy Floppies    141.0
Lawn Chairs         32.0
Pool Noodles       139.0
Umbrellas           57.0
Waffle Irons        54.0
Name: inventory, dtype: float64

### STDEV OF Inventory

In [10]:
df["inventory"].groupby(df['item']).std().round()

item
Coolers            25.0
Crossbows          13.0
Flippy Floppies    64.0
Lawn Chairs        14.0
Pool Noodles       82.0
Umbrellas          28.0
Waffle Irons       61.0
Name: inventory, dtype: float64

In [37]:
df.loc[df.groupby("item")["sales"].idxmax()]

               item month  sales  inventory  orders  order size  turnover
30          Coolers   Jul     78         68       6          10    1.1471
47        Crossbows   Dec    142         26       0           5    5.4615
74  Flippy Floppies   Mar     90         46       1         100    1.9565
6       Lawn Chairs   Jul     50         25       2          20    2.0000
62     Pool Noodles   Mar     98         69       1          50    1.4203
15        Umbrellas   Apr     70         85       1          25    0.8235
49     Waffle Irons   Feb    112        157       0          20    0.7134

In [60]:
df.pivot_table(index='item', aggfunc='mean')

                  inventory  order size    orders      sales  turnover
item
Coolers           66.166667          10  3.333333  38.583333  0.731558
Crossbows         19.250000           5  7.583333  51.750000  3.508067
Flippy Floppies  140.583333         100  0.666667  73.083333  0.707600
Lawn Chairs       31.916667          20  1.083333  22.083333  1.034383
Pool Noodles     139.000000          50  0.916667  64.666667  0.792358
Umbrellas         56.833333          25  1.916667  48.333333  1.318467
Waffle Irons      53.833333          20  1.583333  55.916667  3.080150

In [18]:
df.pivot_table(values = "sales", index='item', aggfunc='max')

                 sales
item
Coolers             78
Crossbows          142
Flippy Floppies     90
Lawn Chairs         50
Pool Noodles        98
Umbrellas           70
Waffle Irons       112

In [28]:
df.groupby(df["item"]).sales.agg(["max","mean"]).round()

                 max  mean
item
Coolers           78  39.0
Crossbows        142  52.0
Flippy Floppies   90  73.0
Lawn Chairs       50  22.0
Pool Noodles      98  65.0
Umbrellas         70  48.0
Waffle Irons     112  56.0

In [30]:
df.groupby(df["item"]).inventory.agg(["max","mean"]).round()

                 max   mean
item
Coolers          100   66.0
Crossbows         50   19.0
Flippy Floppies  233  141.0
Lawn Chairs       53   32.0
Pool Noodles     276  139.0
Umbrellas        104   57.0
Waffle Irons     200   54.0

In [24]:
df.groupby(df["item"]).turnover.agg(["std","mean"])

                      std      mean
item
Coolers          0.606469  0.731558
Crossbows        1.924258  3.508067
Flippy Floppies  0.521232  0.707600
Lawn Chairs      1.075140  1.034383
Pool Noodles     0.758489  0.792358
Umbrellas        1.226316  1.318467
Waffle Irons     4.030339  3.080150

In [37]:
df.loc[df.groupby("item")["sales"].idxmax()]

               item month  sales  inventory  orders  order size  turnover
30          Coolers   Jul     78         68       6          10    1.1471
47        Crossbows   Dec    142         26       0           5    5.4615
74  Flippy Floppies   Mar     90         46       1         100    1.9565
6       Lawn Chairs   Jul     50         25       2          20    2.0000
62     Pool Noodles   Mar     98         69       1          50    1.4203
15        Umbrellas   Apr     70         85       1          25    0.8235
49     Waffle Irons   Feb    112        157       0          20    0.7134